docs: Update README and gitignore
